using HomeWork3_6_2;
using System.Text;


Console.OutputEncoding = Encoding.Unicode;

var page1 = new Page(
    "Коли Іванові минуло сім літ, він уже дивився на світ інакше. Він знав вже багато. Умів знаходити помічне зілля —— одален,\n" +
    "матриган і підойму, розумів, про що канькає каня, з чого повстала зозуля, і коли оповідав про все те вдома, мати непевно\n" +
    "позирала на нього: може, воно до нього говорить? Знав, що на світі панує нечиста сила, що арідник (злий дух) править усім;\n" +
    "що в лісах повно лісовиків, які пасуть там свою маржинку(6): оленів, зайців і серн; що там блукає веселий чугайстир, який\n" +
    "зараз просить стрічного в танець та роздирає нявки; що живе в лісі голос сокири. Вище, по безводних далеких недеях(7),\n" +
    "нявки розводять свої безконечні танки, а по скелях ховається щезник. Міг би розказати і про русалок, що гарної днини\n" +
    "виходять з води на берег, щоб співати пісень, вигадувать байки і молитви, про потопельників, які по заході сонця сушать бліде\n" +
    "тіло своє на каменях в річці. Всякі злі духи заповнюють скелі, ліси, провалля, хати й загороди та чигають на\n" +
    "християнина або на маржину, щоб зробити їм шкоду.");
var page2 = new Page(
    "Тепер він вже мав обов'язки —— його посилали пасти корови. Гнав в ліс своїх жовтаню та голубаню, і коли вони потопали\n" +
    "в хвилях лісових трав та молодих смеречок і вже звідти обзивались до нього, як з-під води, тужливим дзвоном своїх дзвінків,\n" +
    "він сідав десь на узбіччі гори, виймав денцівку (сопілку) і вигравав немудрі пісні, яких навчився од старших.\n" +
    "Однак та музика не вдовольняла його. З досадою кидав денцівку і слухав інших мелодій, що жили в ньому, неясні і невловимі.");
var page3 = new Page(
    "Одного разу він покинув свої корови і подряпавсь на самий грунь (верх). Ледве помітною стежкою підіймавсь вище і вище,\n" +
    "поміж густі зарослі блідої папороті, колючої ожини й малини. Легко перескакував з камінця на камінчик, перелазив через\n" +
    "повалені дерева, продирався крізь гіллячки кущів. За ним підіймався з долини вічний шум річки, росли гори, і вже вставав \n" +
    "на крайнебі блакитний привид Чорногори. Довгі плакучі трави крили тепер боки гори, дзвінки корів обзивались, як далеке\n" +
    "зітхання, все частіше попадалось велике каміння, що далі, на самім вершку, творило хаос поламаних скель, списаних лишаями,\n" +
    "здушених у гадючих обіймах корінням смерек. Під ногами в Івана кождий камінь вкривали рудаві мхи, грубі м'які, шовкові.\n" +
    "Теплі і ніжні, вони ховали у собі позолочену сонцем воду літніх дощів, м'яко вгинались і обіймали ногу, як пухова подушка.\n" +
    "Кучерява зелень гогозів і афин(8) запустила своє коріння у глибінь моху, а зверху сипнула росою червоних та синіх ягід.");

var book1 = new Book("Тіні забутих предків", page1, page2, page3);
FindAndReplaceManager.Book =  book1;

string wordToSearch = "ліс";
int counter = 0;
while (FindAndReplaceManager.FindNext(wordToSearch)) {
    counter++;
}

Console.WriteLine($"Слово '{wordToSearch}' знайдено {counter} раз(ів)");


wordToSearch = "вище";
counter = 0;
while (FindAndReplaceManager.FindNext(wordToSearch)) {
    counter++;
}

Console.WriteLine($"Слово '{wordToSearch}' знайдено {counter} раз(ів)");